# GetInverse Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform2D..::..GetInverse Method
Transform2D Class See Also
---
Gets the inverse transformation of this transformation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public Transform2D GetInverse()
```

Visual Basic
---
```text
Public Function GetInverse As Transform2D
```

Visual C++
---
```text
public:
Transform2D^ GetInverse()
```

# Remarks
The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This transformation is not conformal or invertible. |

# See Also
Transform2D Class
Autodesk.Revit.DB Namespace